In [1]:
import sqlite3
import pandas as pd

In [2]:
#create an empty database file, called food.db

#recall, if a db does not exist when you connect, sqlite3 creates one
conn = sqlite3.connect('food.db')

**food.sql**

The following cell does what the food.sql file is supposed to do, so you don't need to define a separate food.sql file.

In [3]:
#insert tables into the food.db database. Note you don't have to define a separate food.sql file if you just run this instead.

cursor = conn.cursor()

#categories table
cursor.execute("DROP TABLE IF EXISTS categories; --Use this before re-running the CREATE TABLE statements")

cursor.execute("""
CREATE TABLE categories (
 category_id INT PRIMARY KEY,
 category_name TEXT
);
""")

cursor.execute("""
INSERT INTO categories VALUES
 (1, 'milk'),
 (2, 'soda'),
 (3, 'juice');
""")

#menu table
cursor.execute("""
DROP TABLE IF EXISTS menu; --Use this before re-running the CREATE TABLE statements
""")

cursor.execute("""
CREATE TABLE menu (
 menu_id INT PRIMARY KEY,
 menu_name TEXT,
 category_id INT,
 unit_price REAL,
 FOREIGN KEY (category_id) REFERENCES categories(category_id)
);
""")

cursor.execute("""
INSERT INTO menu VALUES
 (1, 'Plain Milk', '1', 50),
 (2, 'Chocolate Milk', '1', 50),
 (3, 'Strawberry Milk', '1', 50),
 (4, 'Pepsi', '2',55),
 (5, 'Dr Pepper', '2',55),
 (6, 'Sprite', '2',55),
 (7, 'Root Beer', '2',55),
 (8, 'Passion Fruit', '3',60),
 (9, 'Mango Juice', '3',60),
 (10,'Orange Juice', '3',60);
""")

#customers table
cursor.execute("DROP TABLE IF EXISTS customers; --Use this before re-running the CREATE TABLE statements")

cursor.execute("""
CREATE TABLE customers (
 customer_id INT PRIMARY KEY,
 firstname TEXT,
 lastname TEXT,
 city TEXT
);
""")

cursor.execute("""
INSERT INTO customers VALUES
(1, 'Mark', 'Lee', 'Bangkok'),
(2, 'Johnny', 'Suh', 'Phuket'),
(3, 'Jennie', 'Kim', 'Chiang Mai'),
(4, 'Jeno', 'Lee', 'Bangkok'),
(5, 'Karina', 'Yoo', 'Chiang Mai');
""")

#employee table
cursor.execute("DROP TABLE IF EXISTS employee;")

cursor.execute("""
CREATE TABLE employee (
 emp_id INT PRIMARY KEY,
 firstname TEXT,
 lastname TEXT,
 hiredate TEXT,
 branch TEXT
);
""")

cursor.execute("""
INSERT INTO employee VALUES
(1, 'Nicolene', 'Jones', '2020-09-01', 'Bangkok'),
(2, 'Anna', 'Smith', '2021-12-01', 'Phuket'),
(3, 'Jessica', 'Brown', '2020-08-01', 'Chiang Mai');
""")

#orders table
cursor.execute("DROP TABLE IF EXISTS orders; --Use this before re-running the CREATE TABLE statements-- orders Table")

cursor.execute("""
CREATE TABLE orders(
 orderid INT,
 orderdate TEXT,
 menu_id INT,
 quantity INT DEFAULT 0,
 customer_id INT,
 delivery_platform TEXT,
 emp_id INT,
 FOREIGN KEY (menu_id) REFERENCES menu(menu_id),
 FOREIGN KEY (customer_id) REFERENCES customers(customer_id),
 FOREIGN KEY (emp_id) REFERENCES employee(emp_id)
);
""")

cursor.execute("""
INSERT INTO orders VALUES
(1, '2022-08-01', 1, 1, 4, 'Grabfood', 1),
(2, '2022-08-01', 6, 2, 1, 'Lineman', 1),
(3, '2022-08-02', 2, 2, 2, 'Robinhood', 2),
(4, '2022-08-03', 3, 1, 5, 'Grabfood', 3),
(5, '2022-08-04', 1, 1, 2, 'Robinhood', 2),
(6, '2022-08-05', 6, 1, 4, 'Grabfood', 1),
(7, '2022-08-05', 10, 1, 3, 'Grabfood', 3),
(8, '2022-08-09', 3, 2, 4, 'Grabfood', 1),
(9, '2022-08-13', 5, 3, 1, 'Lineman', 1),
(10, '2022-08-13', 6, 1, 2, 'Robinhood', 2),
(11, '2022-08-13', 7, 1, 5, 'Lineman', 3),
(12, '2022-08-14', 4, 1, 5, 'Grabfood', 3),
(13, '2022-08-15', 5, 2, 3, 'Grabfood', 3),
(14, '2022-08-15', 10, 1, 2, 'Robinhood', 2),
(15, '2022-08-18', 5, 2, 1, 'Lineman', 1),
(16, '2022-08-20', 6, 1, 2, 'Robinhood', 2),
(17, '2022-08-21', 4, 2, 1, 'Lineman', 1),
(18, '2022-08-25', 5, 1, 5, 'Grabfood', 3),
(19, '2022-08-26', 5, 3, 3, 'Grabfood', 3),
(20, '2022-08-29', 6, 2, 4, 'Grabfood', 1),
(21, '2021-08-29', 6, 2, 4, 'Grabfood', 1),
(22, '2021-08-29', 3, 1, 4, 'Grabfood', 1),
(23, '2022-09-01', 6, 1, 2, 'Robinhood', 2);
""")

conn.commit()

In [4]:
#did it work?
cursor.execute('select * from orders')
cursor.fetchall()

[(1, '2022-08-01', 1, 1, 4, 'Grabfood', 1),
 (2, '2022-08-01', 6, 2, 1, 'Lineman', 1),
 (3, '2022-08-02', 2, 2, 2, 'Robinhood', 2),
 (4, '2022-08-03', 3, 1, 5, 'Grabfood', 3),
 (5, '2022-08-04', 1, 1, 2, 'Robinhood', 2),
 (6, '2022-08-05', 6, 1, 4, 'Grabfood', 1),
 (7, '2022-08-05', 10, 1, 3, 'Grabfood', 3),
 (8, '2022-08-09', 3, 2, 4, 'Grabfood', 1),
 (9, '2022-08-13', 5, 3, 1, 'Lineman', 1),
 (10, '2022-08-13', 6, 1, 2, 'Robinhood', 2),
 (11, '2022-08-13', 7, 1, 5, 'Lineman', 3),
 (12, '2022-08-14', 4, 1, 5, 'Grabfood', 3),
 (13, '2022-08-15', 5, 2, 3, 'Grabfood', 3),
 (14, '2022-08-15', 10, 1, 2, 'Robinhood', 2),
 (15, '2022-08-18', 5, 2, 1, 'Lineman', 1),
 (16, '2022-08-20', 6, 1, 2, 'Robinhood', 2),
 (17, '2022-08-21', 4, 2, 1, 'Lineman', 1),
 (18, '2022-08-25', 5, 1, 5, 'Grabfood', 3),
 (19, '2022-08-26', 5, 3, 3, 'Grabfood', 3),
 (20, '2022-08-29', 6, 2, 4, 'Grabfood', 1),
 (21, '2021-08-29', 6, 2, 4, 'Grabfood', 1),
 (22, '2021-08-29', 3, 1, 4, 'Grabfood', 1),
 (23, '2022-09-01', 6, 1, 2, 'Robinhood', 2)]

**food-queries.sql**

In the following cells, you define the queries to answer the questions of the lab. This is where the lab really begins! If you choose to do the lab here, you don't need to define a separate food-queries.sql file, you can just submit this colab notebook. So instead of pasting your solution, you can just run the query (with limit 5 at the end), then run cursor.fetchall() to show the output after running the cell. For example, the following cell shows the output I expect for question 0: Find all menu items (menu table).

In [5]:
#question 0: find all menu items (menu table)

cursor.execute("""
select *
from menu
limit 5;
""")

cursor.fetchall()

[(1, 'Plain Milk', 1, 50.0),
 (2, 'Chocolate Milk', 1, 50.0),
 (3, 'Strawberry Milk', 1, 50.0),
 (4, 'Pepsi', 2, 55.0),
 (5, 'Dr Pepper', 2, 55.0)]

## Section 1: Special Operators

1. Find the names of all juice items (menu table)
2. Find all orders (order table) between August 1 and 9, 2022
3. Find the orders (order table) where the delivery platform contains the substring 'ood'
4. Find the **unique** delivery order companies from the order table. Get only the name, no other data.
5. Sort the orders table by quantity, largest to smallest.

In [13]:
#section 1 question 1

#This is the last example I will give to help get you started!

cursor.execute("""
select menu_name
from menu
where category_id = 3
limit 5;
""")

cursor.fetchall()

[('Passion Fruit',), ('Mango Juice',), ('Orange Juice',)]

In [14]:
#if you want to get real fancy with question 1, or if you didn't know that category_id = 3 is juice, then you could also solve question 1 by merging the menu table and categories table
#on category id and filtering down to category_name = 'juice'

cursor.execute("""
select menu.menu_name
from menu inner join categories
on menu.category_id = categories.category_id
where categories.category_name = 'juice'
""")

cursor.fetchall()

[('Passion Fruit',), ('Mango Juice',), ('Orange Juice',)]

In [7]:
#section 1 question 2

In [8]:
#section 1 question 3

In [9]:
#section 1 question 4

In [10]:
#section 1 question 5

## Section 2: Functions

6. Find minimum, maximum, and average unit price from the menu table
7. Select order id, date, and delivery platform, but change any occurrence of the substring "Grab" to "Cougar"
<br>
**Hint:** Use the REPLACE function (https://app.datacamp.com/learn/tutorials/sql-replace)

In [15]:
#section 2 question 6

In [16]:
#section 2 question 7

## Section 3: Group By

8. Find the average, min, and max order quantity by delivery platform
9. Find the number of orders by delivery platform, but filter to the delivery platform(s) with a count greater than five
10. Find the total number of units sold by the delivery platform

In [17]:
#section 3 question 8

In [18]:
#section 3 question 9

In [19]:
#section 3 question 10

## Section 4: Joins

11. Get the order id, order quantity, customer id, customer first name, and customer last name for all orders
12. Get the order id, order quantity, delivery platform, unit price, and revenue (quantity * unit price) for all orders

In [20]:
#section 4 question 11

In [21]:
#section 4 question 12

In [22]:
## Last but not least, remember to close the connection!
conn.close()